In [1]:
import pandas as pd
import numpy as np
labels=['a','b','c']
my_data=[10,20,30]
ar=np.array(my_data)
d={'a':10,'b':20,'c':30}
print("Labels:",labels)
print("My Data:",my_data)
print("Dictionary",d)
pd.Series(my_data,index=labels)

Labels: ['a', 'b', 'c']
My Data: [10, 20, 30]
Dictionary {'a': 10, 'b': 20, 'c': 30}

a    10
b    20
c    30
dtype: int64

In [2]:
print("\nHolding numerical data\n",'-'*25,sep='')
print(pd.Series(ar)[0])
print(pd.Series(ar)[1])

Holding numerical data
-------------------------
10
20

In [3]:
print("\nHolding new Text labels\n",)
print(pd.Series(labels))

Holding new Text labels

0    a
1    b
2    c
dtype: object

In [4]:
d={'a':"kjhk",'b':20,'c':30}
d.items
pd.DataFrame(d,index=['a','b','c'])

      a   b   c
a  kjhk  20  30
b  kjhk  20  30
c  kjhk  20  30

In [6]:
print("\nHolding objects from a dictionary\n",'-'*40,sep='')
print(pd.Series([type,sum,max]))

Holding objects from a dictionary
----------------------------------------
0             <class 'type'>
1    <built-in function sum>
2    <built-in function max>
dtype: object

In [17]:
ser1=pd.Series([1,2,3,4],index = [2,4,6,8])
ser2=pd.Series([1,2,5,4],['CA','OR','NV','AZ'])    
ser1

2    1
4    2
6    3
8    4
dtype: int64

In [10]:
ser1[0:3:2]

2    1
6    3
dtype: int64

In [11]:
print("\nIndexing by a range\n",'-'*25,sep='')
print("value for OR, CO and AZ in ser1:\n",ser1[0:3:2],sep='')

Indexing by a range
-------------------------
value for OR, CO and AZ in ser1:
2    1
6    3
dtype: int64

In [12]:
ser1=pd.Series([1,2,3,4],['CA','OR','CO','CA'])
ser2=pd.Series([1,2,3,4],['CA','NV','AZ','OR'])
ser3=ser1+ser2
ser3

AZ    NaN
CA    2.0
CA    5.0
CO    NaN
NV    NaN
OR    6.0
dtype: float64

In [13]:
print("\n After adding the two series,the result look like this..\n",'-'*25,sep='')
print(ser3)
print("\npython tries to add values where it find commomn index name and put Nan where indices are misssig\n")

 After adding the two series,the result look like this..
-------------------------
AZ    NaN
CA    2.0
CA    5.0
CO    NaN
NV    NaN
OR    6.0
dtype: float64

python tries to add values where it find commomn index name and put Nan where indices are misssig

In [14]:
print("\n After the adding two series the idea for multiplcation...\n",'-'*43,sep='')
ser1*ser2

 After the adding two series the idea for multiplcation...
-------------------------------------------

AZ    NaN
CA    1.0
CA    4.0
CO    NaN
NV    NaN
OR    8.0
dtype: float64

In [28]:
from numpy.random import randn as rn
matrix_data=rn(5,4)
row_labels=['A','B','C','D','E']
Column_heading=['w','X','Y','Z']
df1=pd.DataFrame(matrix_data,row_labels,Column_heading)
print("\n The data frame looks like\n",'-'*45,sep='')
df1

 The data frame looks like
---------------------------------------------

          w         X         Y         Z
A  0.427341  0.871447 -0.614734 -0.527587
B -1.259390 -0.512804 -0.097233 -0.593983
C -1.023828  0.627687  0.406804 -0.408431
D -2.208594 -3.104526  0.365903  1.354431
E -1.394094 -0.592479  0.681552 -0.989820

In [29]:
df1.iloc[2]

w   -1.023828
X    0.627687
Y    0.406804
Z   -0.408431
Name: C, dtype: float64

In [30]:
df1.iloc[0]

w    0.427341
X    0.871447
Y   -0.614734
Z   -0.527587
Name: A, dtype: float64

In [31]:
df1.iloc[3]

w   -2.208594
X   -3.104526
Y    0.365903
Z    1.354431
Name: D, dtype: float64

In [32]:
print("\nType of the Pair of columns:",type(df[['X','Z']]),sep='')
print("\n So,for more than one column,the object turn into a Dataframe")

Type of the Pair of columns:<class 'pandas.core.frame.DataFrame'>

 So,for more than one column,the object turn into a Dataframe

In [33]:
print("\nThe 'X' column accessed by DOT method (NoT recommended)\n",'-'*55,sep='')
print(df1['X'])

The 'X' column accessed by DOT method (NoT recommended)
-------------------------------------------------------
A    0.871447
B   -0.512804
C    0.627687
D   -3.104526
E   -0.592479
Name: X, dtype: float64

In [34]:
print("\nA column is created by assigning it in relation to an existing \n",'-'*75,sep='')
df1['New']=df['X']+df['Z']
df1['New(sum of x and Z )']=df['X']+df['Z']
print(df)

A column is created by assigning it in relation to an existing
---------------------------------------------------------------------------
          w         X         Y         Z       New  New(sum of x and Z )  \
A -1.207775 -0.856153  0.130744  1.950774 -0.725409              1.094621
B -0.018673  0.106650  0.979788  0.230676  1.086439              0.337326
C -0.038621 -0.595137  0.389014  1.374008 -0.206123              0.778871
D -0.099524 -1.045696  1.054270 -1.896427  0.008574             -2.942122
E -1.551389  1.647379  1.546147  0.679554  3.193525              2.326932

   New(sum of x and Y)
A            -0.725409
B             1.086439
C            -0.206123
D             0.008574
E             3.193525

In [35]:
print("\nThe dataframe of column is created by assinging it in the realtion to an existing: \n",'-'*82,sep='')
df1[("New")]=df["X"]+df["Y"]
df1["New(sum of x and Y)"]=df["X"]+df["Y"]
print(df)

The dataframe of column is created by assinging it in the realtion to an existing:
----------------------------------------------------------------------------------
          w         X         Y         Z       New  New(sum of x and Z )  \
A -1.207775 -0.856153  0.130744  1.950774 -0.725409              1.094621
B -0.018673  0.106650  0.979788  0.230676  1.086439              0.337326
C -0.038621 -0.595137  0.389014  1.374008 -0.206123              0.778871
D -0.099524 -1.045696  1.054270 -1.896427  0.008574             -2.942122
E -1.551389  1.647379  1.546147  0.679554  3.193525              2.326932

   New(sum of x and Y)
A            -0.725409
B             1.086439
C            -0.206123
D             0.008574
E             3.193525

In [36]:
df1

,w,X,Y,Z,New,New(sum of x and Z ),New(sum of x and Y)
A,0.427341,0.871447,-0.614734,-0.527587,-0.725409,1.094621,-0.725409
B,-1.259390,-0.512804,-0.097233,-0.593983,1.086439,0.337326,1.086439
C,-1.023828,0.627687,0.406804,-0.408431,-0.206123,0.778871,-0.206123
D,-2.208594,-3.104526,0.365903,1.354431,0.008574,-2.942122,0.008574
E,-1.394094,-0.592479,0.681552,-0.989820,3.193525,2.326932,3.193525

In [42]:
df1=df.drop('B')
print("\nThe row(index)is dropped by using df.drop()method and axis=0\n",'-'*70,sep='')
print(df1)

The row(index)is dropped by using df.drop()method and axis=0
----------------------------------------------------------------------
          w         X         Y         Z       New  New(sum of x and Z )  \
A -1.207775 -0.856153  0.130744  1.950774 -0.725409              1.094621
C -0.038621 -0.595137  0.389014  1.374008 -0.206123              0.778871
D -0.099524 -1.045696  1.054270 -1.896427  0.008574             -2.942122
E -1.551389  1.647379  1.546147  0.679554  3.193525              2.326932

   New(sum of x and Y)
A            -0.725409
C            -0.206123
D             0.008574
E             3.193525

In [43]:
df1=df.drop('A')
print("\nA row (index) is dropped by using df.drop() method and axis=0\n",'-'*65, sep='')
print(df1)

A row (index) is dropped by using df.drop() method and axis=0
-----------------------------------------------------------------
          w         X         Y         Z       New  New(sum of x and Z )  \
B -0.018673  0.106650  0.979788  0.230676  1.086439              0.337326
C -0.038621 -0.595137  0.389014  1.374008 -0.206123              0.778871
D -0.099524 -1.045696  1.054270 -1.896427  0.008574             -2.942122
E -1.551389  1.647379  1.546147  0.679554  3.193525              2.326932

   New(sum of x and Y)
B             1.086439
C            -0.206123
D             0.008574
E             3.193525

In [46]:
# Selecting/indexing Rows
# label-based 'loc method'
# Index(numeric)'iloc'method
df1

,w,X,Y,Z,New,New(sum of x and Z ),New(sum of x and Y)
B,-0.018673,0.106650,0.979788,0.230676,1.086439,0.337326,1.086439
C,-0.038621,-0.595137,0.389014,1.374008,-0.206123,0.778871,-0.206123
D,-0.099524,-1.045696,1.054270,-1.896427,0.008574,-2.942122,0.008574
E,-1.551389,1.647379,1.546147,0.679554,3.193525,2.326932,3.193525

In [56]:
print("\n label-based 'loc'method can be used for selecting rows:\n",'-'*56,sep='')
print("\nsingle row\n")
print(df1.iloc[3])

 label-based 'loc'method can be used for selecting rows:
--------------------------------------------------------

single row

w                      -1.551389
X                       1.647379
Y                       1.546147
Z                       0.679554
New                     3.193525
New(sum of x and Z )    2.326932
New(sum of x and Y)     3.193525
Name: E, dtype: float64

In [59]:
print('\nMulitiple rows\n')
print(df1.loc[['B','C']])

Mulitiple rows

          w         X         Y         Z       New  New(sum of x and Z )  \
B -0.018673  0.106650  0.979788  0.230676  1.086439              0.337326
C -0.038621 -0.595137  0.389014  1.374008 -0.206123              0.778871

   New(sum of x and Y)
B             1.086439
C            -0.206123

In [60]:
print(df1.iloc[1])

w                      -0.038621
X                      -0.595137
Y                       0.389014
Z                       1.374008
New                    -0.206123
New(sum of x and Z )    0.778871
New(sum of x and Y)    -0.206123
Name: C, dtype: float64

In [61]:
print(df1.iloc[2])

w                      -0.099524
X                      -1.045696
Y                       1.054270
Z                      -1.896427
New                     0.008574
New(sum of x and Z )   -2.942122
New(sum of x and Y)     0.008574
Name: D, dtype: float64

In [62]:
print(df1.iloc[3])

w                      -1.551389
X                       1.647379
Y                       1.546147
Z                       0.679554
New                     3.193525
New(sum of x and Z )    2.326932
New(sum of x and Y)     3.193525
Name: E, dtype: float64

In [64]:
print(df1.iloc[[1,2]])

          w         X         Y         Z       New  New(sum of x and Z )  \
C -0.038621 -0.595137  0.389014  1.374008 -0.206123              0.778871
D -0.099524 -1.045696  1.054270 -1.896427  0.008574             -2.942122

   New(sum of x and Y)
C            -0.206123
D             0.008574

In [71]:
#At atime select Multiple Rows:
print("\nMultiple Rows Selected:\n",'-'*42,sep='')
print(df1.iloc[[0,1,2,3]])

Multiple Rows Selected:
------------------------------------------
          w         X         Y         Z       New  New(sum of x and Z )  \
B -0.018673  0.106650  0.979788  0.230676  1.086439              0.337326
C -0.038621 -0.595137  0.389014  1.374008 -0.206123              0.778871
D -0.099524 -1.045696  1.054270 -1.896427  0.008574             -2.942122
E -1.551389  1.647379  1.546147  0.679554  3.193525              2.326932

   New(sum of x and Y)
B             1.086439
C            -0.206123
D             0.008574
E             3.193525

In [76]:
#Subnetting Dataframe :-
import pandas as pd
import numpy as np
Matrix_data=rn(5,4)
row_label=['A','B','C','D','E']
Column_wise_label=['W','X','Y','Z']
print('\n The data_frame\n','-'*30,sep='')
df2=pd.DataFrame(data=Matrix_data, index=row_label, columns=Column_wise_label)
print(df2)

 The data_frame
------------------------------
          W         X         Y         Z
A -1.725170  0.244623  0.358809  0.639146
B  0.177972  1.785949  0.319403 -2.003935
C  0.037862 -1.019700  1.342751  0.898230
D  0.505421  0.182168 -1.151523 -1.697933
E  0.560378 -0.009910  1.097039 -0.083853

In [83]:
df2.iloc[0]

W   -1.725170
X    0.244623
Y    0.358809
Z    0.639146
Name: A, dtype: float64

In [84]:
df2.iloc[[0,1]]

          W         X         Y         Z
A -1.725170  0.244623  0.358809  0.639146
B  0.177972  1.785949  0.319403 -2.003935

In [86]:
print(df2.loc[['D','E']])

          W         X         Y         Z
D  0.505421  0.182168 -1.151523 -1.697933
E  0.560378 -0.009910  1.097039 -0.083853

In [88]:
#Nested Loc-wise_Row_&_Column Index:-
print("\n subset comprising of rows B and D and column W and Y,is\n")
df.iloc[[1,2,3],[0,1]]

 subset comprising of rows B and D and column W and Y,is

          w         X
B -0.018673  0.106650
C -0.038621 -0.595137
D -0.099524 -1.045696

In [89]:
print("\n Subset Comprosing of rows B and D column W and Y,is \n")
df.iloc[[1,2,3],[1,3]]

 Subset Comprosing of rows B and D column W and Y,is

          X         Z
B  0.106650  0.230676
C -0.595137  1.374008
D -1.045696 -1.896427

In [93]:
print("\n Boolean Dataframe(s)where are  checking if values are greater than 0\n",'-'*75,sep='')
print(df1>0)

 Boolean Dataframe(s)where are  checking if values are greater than 0
---------------------------------------------------------------------------
       w      X     Y      Z    New  New(sum of x and Z )  New(sum of x and Y)
B  False   True  True   True   True                  True                 True
C  False  False  True   True  False                  True                False
D  False  False  True  False   True                 False                 True
E  False   True  True   True   True                  True                 True

In [95]:
print("\n")
print(df.loc[['A','B','C']]>0)

       w      X     Y     Z    New  New(sum of x and Z )  New(sum of x and Y)
A  False  False  True  True  False                  True                False
B  False   True  True  True   True                  True                 True
C  False  False  True  True  False                  True                False

In [97]:
#Similarly apply for Condn >1,2,3 as per Requirement:
print("\n")
print(df.loc[['A','B','C']]>1)

       w      X      Y      Z    New  New(sum of x and Z )  \
A  False  False  False   True  False                  True
B  False  False  False  False   True                 False
C  False  False  False   True  False                 False

   New(sum of x and Y)
A                False
B                 True
C                False

In [17]:
# matrix_data=rn(5,4)#Previously Random 5*4 Matrix. 
import pandas as pd 
import numpy as np
matrix_data=np.matrix('22,23,24;70,90,120;66,29,20;23,45,21;34,22,67')
row_labels=['A','B','C','D','E']
Column_heading=['Age','Height','Weight']
matrix_data

matrix([[ 22,  23,  24],
        [ 70,  90, 120],
        [ 66,  29,  20],
        [ 23,  45,  21],
        [ 34,  22,  67]])

In [23]:
srt=pd.DataFrame(data=matrix_data, index=row_labels,columns=Column_heading)
print("\n A New data_frame:\n",'-'*18,sep='')
print(srt)

 A New data_frame:
------------------
   Age  Height  Weight
A   22      23      24
B   70      90     120
C   66      29      20
D   23      45      21
E   34      22      67

In [34]:
#Similarly Create Matrix_data As per requirment
import pandas as pd
import numpy as np
matrix_data=np.matrix('210,200,150,34;150,180,200,20;100,200,100,26')
row_labels=['A','B','C']
Column_labels=['Age','Height','weight','obese']
df=pd.DataFrame(data=matrix_data,index=row_labels,columns=Column_labels)
print("\n Again New Data formation :\n",'-'*28,sep='')
print(df)

 Again New Data formation :
----------------------------
   Age  Height  weight  obese
A  210     200     150     34
B  150     180     200     20
C  100     200     100     26

In [36]:
df[df['Height']>180]

   Age  Height  weight  obese
A  210     200     150     34
C  100     200     100     26

In [38]:
df[srt['Weight']>60]

<ipython-input-38-53eed02c719c>:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df[srt['Weight']>60]

   Age  Height  weight  obese
B  150     180     200     20

In [47]:
print("\n Rows with Height >65 inch \n",'-'*26,sep='')
print(df[df['Age']>150])

 Rows with Height >65 inch
--------------------------
   Age  Height  weight  obese
A  210     200     150     34

In [48]:
df['Height']>60

A    True
B    True
C    True
Name: Height, dtype: bool

In [56]:
booldf1=df['weight']>100
booldf2=df['Height']>145
print("\nRows with Height>65 inch and Weight >145 lbs \n",'-'*44,sep='')
print(df[(booldf1)&(booldf2)])

Rows with Height>65 inch and Weight >145 lbs
--------------------------------------------
   Age  Height  weight  obese
A  210     200     150     34
B  150     180     200     20

In [61]:
print("\nDataframe with only age and weight columns whoose Height>65 inch:\n",'-'*64,sep='')
print(df[booldf1][['Age','weight']])

Dataframe with only age and weight columns whoose Height>65 inch:
----------------------------------------------------------------
   Age  weight
A  210     150
B  150     200

In [76]:
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['A','B','C','D','E']
column_headings = ['Age', 'Height', 'Weight']
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
print("\nThe DataFrame\n",'-'*13, sep='')
print(df)

The DataFrame
-------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [81]:
print(df.reset_index())

  index  Age  Height  Weight
0     A   22      66     140
1     B   42      70     148
2     C   30      62     125
3     D   35      68     160
4     E   25      62     152

In [82]:
print("\n Resetting index:\n",'-'*17,sep='')
print(df.reset_index(drop=True))
"Student Teacher Engineer Doctor Nurse".split()

 Resetting index:
-----------------
   Age  Height  Weight
0   22      66     140
1   42      70     148
2   30      62     125
3   35      68     160
4   25      62     152

['Student', 'Teacher', 'Engineer', 'Doctor', 'Nurse']

In [89]:
#Add New Column as Profession in Data_frame:
print("\n Add New Column as Profssion: \n",'-'*30,sep='')
df['profession']="Student Teacher Engineer Doctor Nurse".split() 
print(df)

 Add New Column as Profssion:
------------------------------
   Age  Height  Weight profession
A   22      66     140    Student
B   42      70     148    Teacher
C   30      62     125   Engineer
D   35      68     160     Doctor
E   25      62     152      Nurse

In [95]:
print("\n Setting add 'profession' column as index\n",'-'*42,sep='')
print(df.set_index('profession'))

 Setting add 'profession' column as index
------------------------------------------
            Age  Height  Weight
profession
Student      22      66     140
Teacher      42      70     148
Engineer     30      62     125
Doctor       35      68     160
Nurse        25      62     152

In [116]:
import pandas as pd
import numpy as np
matrix_data=np.matrix('23,66,140;40,70,148;31,62,125;35,66,160;25,62,152')
rowwise_index=['A','B','C','D','E']
columnwise_index=['Age','Weight','Height']
matrix_data

matrix([[ 23,  66, 140],
        [ 40,  70, 148],
        [ 31,  62, 125],
        [ 35,  66, 160],
        [ 25,  62, 152]])

In [117]:
print("\n Creste and convert into a dataframe structure:\n",'-'*47,sep='')
df=pd.DataFrame(data=matrix_data,index=rowwise_index,columns=columnwise_index)
print(df)

 Creste and convert into a dataframe structure:
-----------------------------------------------
   Age  Weight  Height
A   23      66     140
B   40      70     148
C   31      62     125
D   35      66     160
E   25      62     152

In [118]:
print(df.reset_index())

  index  Age  Weight  Height
0     A   23      66     140
1     B   40      70     148
2     C   31      62     125
3     D   35      66     160
4     E   25      62     152

In [119]:
print("\n Reset the Data Frame:\n",'-'*22,sep='')
print(df.reset_index(drop=True))
"Lab_Assistant Peon Clerk Teacher Professor".split()

 Reset the Data Frame:
----------------------
   Age  Weight  Height
0   23      66     140
1   40      70     148
2   31      62     125
3   35      66     160
4   25      62     152

['Lab_Assistant', 'Peon', 'Clerk', 'Teacher', 'Professor']

In [120]:
# Add the column into Datagrame:
print("\n Add a new Column into Data_frame profession:\n",'-'*45,sep='')
df['Profession']="Lab_Assistant Peon Clerk Teacher Professor".split()
print(df)

 Add a new Column into Data_frame profession:
---------------------------------------------
   Age  Weight  Height     Profession
A   23      66     140  Lab_Assistant
B   40      70     148           Peon
C   31      62     125          Clerk
D   35      66     160        Teacher
E   25      62     152      Professor

In [124]:
#Setting for new Dataframe:
print("\n Add and Setting up a new dataframe column as index:\n",'-'*52,sep='')
print(df.set_index('Profession'))

 Add and Setting up a new dataframe column as index:
----------------------------------------------------
               Age  Weight  Height
Profession
Lab_Assistant   23      66     140
Peon            40      70     148
Clerk           31      62     125
Teacher         35      66     160
Professor       25      62     152

In [128]:
#Muiti indexing and Indexing Levels:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
heir_index=list(zip(outside,inside))
print("\n Tuple pair after The Zip and list command: \n",'-'*42,sep='')
print(heir_index)

 Tuple pair after The Zip and list command:
------------------------------------------
[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [136]:
import pandas as pd
heir_index=pd.MultiIndex.from_tuples(heir_index)
print("\nIndex hierarchy:\n",'-'*16,sep='')
print(type(heir_index))
print(heir_index)

Index hierarchy:
----------------
<class 'pandas.core.indexes.multi.MultiIndex'>
MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [144]:
import pandas as pd
import numpy as np
from numpy.random import randn as rn
df4=pd.DataFrame(data=np.round(rn(6,3)),index=heir_index,columns=['A','B','C'])
print(df4)

        A    B    C
G1 1  3.0  1.0  1.0
   2  1.0  1.0 -0.0
   3 -1.0  1.0 -2.0
G2 1  1.0  1.0 -1.0
   2  0.0 -1.0 -1.0
   3  1.0  0.0  2.0

In [146]:
#Cross tabulation like Pivot table:
print("\n Grabbing a cross section from out level\n",'-'*40,sep='')
print(df4.xs('G1'))

 Grabbing a cross section from out level
----------------------------------------
     A    B    C
1  3.0  1.0  1.0
2  1.0  1.0 -0.0
3 -1.0  1.0 -2.0

In [147]:
print("\n Grabbing a cross section from out level\n",'-'*40,sep='')
print(df4.xs('G2'))

 Grabbing a cross section from out level
----------------------------------------
     A    B    C
1  1.0  1.0 -1.0
2  0.0 -1.0 -1.0
3  1.0  0.0  2.0

In [198]:
df3=pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df3['States']="UK India Bang".split()
df3.set_index('States',inplace=True)
df3

          A    B  C
States
UK      1.0  5.0  1
India   2.0  NaN  2
Bang    NaN  NaN  3

In [192]:
df3.isnull()

            A      B      C
States
UK      False  False  False
India   False   True  False
Bang     True   True  False

In [199]:
#Fill the value wit NAN value:
df3.fillna(3)

          A    B  C
States
UK      1.0  5.0  1
India   2.0  3.0  2
Bang    3.0  3.0  3

In [185]:
#Require that drop many non-na values:
#thresh: thresh takes integer value which tells minimum amount of na values to drop.
#axis0 represent rows : axis 1 represent column.
df3.dropna(thresh=3,axis=1,inplace=True)
print("\n Dropping any rows with a NAN values:\n",'-'*36,sep='')
print(df3.dropna(axis=0))

 Dropping any rows with a NAN values:
------------------------------------
        C
States
UK      1
India   2
Bang    3

In [200]:
df6=pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df6['States']="UK India Bang".split()
df6.set_index('States',inplace=True)
df6

          A    B  C
States
UK      1.0  5.0  1
India   2.0  NaN  2
Bang    NaN  NaN  3

In [201]:
print("\n Filling values with Default values \n",'-'*34,sep='')
print(df6.fillna(value='FILL VALUES'))

 Filling values with Default values
----------------------------------
                  A            B  C
States
UK                1            5  1
India             2  FILL VALUES  2
Bang    FILL VALUES  FILL VALUES  3

In [203]:
df7=pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df7['States']="UK India Bang".split()
df7.set_index('States',inplace=True)
df7

          A    B  C
States
UK      1.0  5.0  1
India   2.0  NaN  2
Bang    NaN  NaN  3

In [207]:
df7.fillna (value=df7['C'].mean())

          A    B  C
States
UK      1.0  5.0  1
India   2.0  2.0  2
Bang    2.0  2.0  3

In [228]:
#Create a dataframe dict/json_key:value pair_format:
data={'Company':['Google','MSFT','Infosys','FB','TMahindra','MSFT','Infosys'],
      'Person':['Sam','Charlie','Hari','Carl','Ravi','Jaya','Haraihara'],
      'Sales':[2200,2500,1200,1800,900,2456,3421]}
df8=pd.DataFrame(data)
df8

     Company     Person  Sales
0     Google        Sam   2200
1       MSFT    Charlie   2500
2    Infosys       Hari   1200
3         FB       Carl   1800
4  TMahindra       Ravi    900
5       MSFT       Jaya   2456
6    Infosys  Haraihara   3421

In [229]:
g=df8.groupby('Company')
g

In [230]:
by_comp=df8.groupby('Company')
print("\n Grouping By company column and listening mean of sales \n",'-'*55,sep='')
print(by_comp.mean())

 Grouping By company column and listening mean of sales
-------------------------------------------------------
            Sales
Company
FB         1800.0
Google     2200.0
Infosys    2310.5
MSFT       2478.0
TMahindra   900.0

In [231]:
print(by_comp.sum())

           Sales
Company
FB          1800
Google      2200
Infosys     4621
MSFT        4956
TMahindra    900

In [237]:
print("\n All in one line of command (sates for FB)\n",'-'*42,sep='')
print(pd.DataFrame(df8.groupby('Company').describe().loc['MSFT']).transpose())

 All in one line of command (sates for FB)
------------------------------------------
     Sales
     count    mean        std     min     25%     50%     75%     max
MSFT   2.0  2478.0  31.112698  2456.0  2467.0  2478.0  2489.0  2500.0

In [238]:
print("\n All in one line of command (sates for FB)\n",'-'*42,sep='')
print(pd.DataFrame(df8.groupby('Company').describe().loc['FB']).transpose())

 All in one line of command (sates for FB)
------------------------------------------
   Sales
   count    mean std     min     25%     50%     75%     max
FB   1.0  1800.0 NaN  1800.0  1800.0  1800.0  1800.0  1800.0

In [254]:
df8.groupby('Company').describe()

          Sales
          count    mean          std     min      25%     50%      75%     max
Company
FB          1.0  1800.0          NaN  1800.0  1800.00  1800.0  1800.00  1800.0
Google      1.0  2200.0          NaN  2200.0  2200.00  2200.0  2200.00  2200.0
Infosys     2.0  2310.5  1570.484161  1200.0  1755.25  2310.5  2865.75  3421.0
MSFT        2.0  2478.0    31.112698  2456.0  2467.00  2478.0  2489.00  2500.0
TMahindra   1.0   900.0          NaN   900.0   900.00   900.0   900.00   900.0

In [265]:
df8.groupby('Company').describe().iloc[1:4,1:3]

          Sales
           mean          std
Company
Google   2200.0          NaN
Infosys  2310.5  1570.484161
MSFT     2478.0    31.112698

In [272]:
df8.groupby('Company').describe()['Sales'].loc[['MSFT','Infosys'],['mean','std']]

           mean          std
Company
MSFT     2478.0    31.112698
Infosys  2310.5  1570.484161

In [277]:
#.T transpose the Data_Frame:
data_t=df8.groupby('Company').describe()
df9=data_t.T
df9

Company          FB  Google      Infosys         MSFT  TMahindra
Sales count     1.0     1.0     2.000000     2.000000        1.0
      mean   1800.0  2200.0  2310.500000  2478.000000      900.0
      std       NaN     NaN  1570.484161    31.112698        NaN
      min    1800.0  2200.0  1200.000000  2456.000000      900.0
      25%    1800.0  2200.0  1755.250000  2467.000000      900.0
      50%    1800.0  2200.0  2310.500000  2478.000000      900.0
      75%    1800.0  2200.0  2865.750000  2489.000000      900.0
      max    1800.0  2200.0  3421.000000  2500.000000      900.0

In [281]:
df9.loc['Sales'].loc['mean']

Company
FB           1800.0
Google       2200.0
Infosys      2310.5
MSFT         2478.0
TMahindra     900.0
Name: mean, dtype: float64

In [286]:
# Merging two data frames.
# Creating_data frames.
df10 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3'],
                     'C': ['C0', 'C1', 'C2', 'C3'],
                     'D': ['D0', 'D1', 'D2', 'D3']},
                     index=[0, 1, 2, 3])
df10

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [290]:
df11=pd.DataFrame({'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']},
                     index=[0,1,2,3])
df11

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [297]:
print("\n The dataFrame number 1:\n",'-'*23,sep='')
print(df11)

 The dataFrame number 1:
-----------------------
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [301]:
#_Now_Concatenation_Two Dataframe:
df_cat1=pd.concat([df10,df11],axis=1)
print("\nAfter concatenation along row:\n",'-'*30,sep='')
df_cat1

After concatenation along row:
------------------------------

    A   B   C   D   A   B   C   D
0  A0  B0  C0  D0  A0  B0  C0  D0
1  A1  B1  C1  D1  A1  B1  C1  D1
2  A2  B2  C2  D2  A2  B2  C2  D2
3  A3  B3  C3  D3  A3  B3  C3  D3

In [302]:
df_cat1.iloc[3]

A    A3
B    B3
C    C3
D    D3
A    A3
B    B3
C    C3
D    D3
Name: 3, dtype: object

In [10]:
#_Merging of a_common key:
df13=pd.DataFrame({'Key_1':['K0','K8','K2','K3'],
                  'A':['A0','A1','A2','A3'],
                  'C':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']})
df14=pd.DataFrame({'Key_2':['K0','K1','K2','K3'],
                'C':['C0','C1','C2','C3'],
                'D':['D0','D1','D2','D3']})

In [304]:
df13

  Key_1   A   C   B
0    K0  A0  A0  B0
1    K8  A1  A1  B1
2    K2  A2  A2  B2
3    K3  A3  A3  B3

In [305]:
df14

  Key_2   C   D
0    K0  C0  D0
1    K1  C1  D1
2    K2  C2  D2
3    K3  C3  D3

In [307]:
pd.merge(df13,df14,how='left',left_on='Key_1',right_on='Key_2')

  Key_1   A C_x   B Key_2  C_y    D
0    K0  A0  A0  B0    K0   C0   D0
1    K8  A1  A1  B1   NaN  NaN  NaN
2    K2  A2  A2  B2    K2   C2   D2
3    K3  A3  A3  B3    K3   C3   D3

In [308]:
pd.merge(df13,df14,how='right',left_on='Key_1',right_on='Key_2')

  Key_1    A  C_x    B Key_2 C_y   D
0    K0   A0   A0   B0    K0  C0  D0
1    K2   A2   A2   B2    K2  C2  D2
2    K3   A3   A3   B3    K3  C3  D3
3   NaN  NaN  NaN  NaN    K1  C1  D1

In [331]:
left=pd.DataFrame({'key1':['K0','K0','k1','K2'],
                   'key2':['K0','K1','K0','K1'],
                   'A':['A0','A1','A2','A3'],
                   'B':['BO','B1','B2','B3']})
right=pd.DataFrame({'Key1':['K0','K1','K1','K2'],
                        'key2':['KO','K0','KO','KO'],
                         'C':['C0','C1','C2','C3'],
                          'D':['D0','D1','D2','D3']})

In [332]:
left

  key1 key2   A   B
0   K0   K0  A0  BO
1   K0   K1  A1  B1
2   k1   K0  A2  B2
3   K2   K1  A3  B3

In [336]:
right

  Key1 key2   C   D
0   K0   KO  C0  D0
1   K1   K0  C1  D1
2   K1   KO  C2  D2
3   K2   KO  C3  D3

In [341]:
#join operation:-
left1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right1 = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [342]:
left1

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [343]:
right1

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [345]:
left1.join(right1)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [349]:
left1.join(right1,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [354]:
p1=pd.DataFrame({'key1':['K0','K1','K2','K3'],
                 'A':['A0','A1','A2','A3'],
                 'B':['B0','B1','B2','B3']})
p2=pd.DataFrame({'Key2':['KO','K1','K2','K3'],
                  'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']})
p3=pd.DataFrame({'key3':['KO','K1','K2','K3'],
                  'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']})

In [356]:
df_cat3=pd.concat([p1,p2,p3],axis=1) 
df_cat3=pd.concat([p1,p2,p3]) 
print(df_cat3)

     A    B    C    D Key2 key1 key3
0   A0   B0  NaN  NaN  NaN   K0  NaN
1   A1   B1  NaN  NaN  NaN   K1  NaN
2   A2   B2  NaN  NaN  NaN   K2  NaN
3   A3   B3  NaN  NaN  NaN   K3  NaN
0  NaN  NaN   C0   D0   KO  NaN  NaN
1  NaN  NaN   C1   D1   K1  NaN  NaN
2  NaN  NaN   C2   D2   K2  NaN  NaN
3  NaN  NaN   C3   D3   K3  NaN  NaN
0   A0   B0  NaN  NaN  NaN  NaN   KO
1   A1   B1  NaN  NaN  NaN  NaN   K1
2   A2   B2  NaN  NaN  NaN  NaN   K2
3   A3   B3  NaN  NaN  NaN  NaN   K3

<ipython-input-356-1828979c38d7>:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  df_cat3=pd.concat([p1,p2,p3])

In [369]:
#use of apply functions:
import numpy as np
def testfunc(x):
    if (x>500):
        return(10*np.log10(x))
    else:
        return(x/10)

In [370]:
rf=pd.DataFrame({'col1':[1,2,3,4,5,6,7,8,9,10],
                 'col2':[444,555,666,444,333,222,666,777,666,555],
                 'col3':'aaa bb c dd eeee fff gg h i j'.split()})
rf.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [371]:
rf['col20']=rf['col2'].apply(testfunc)
rf

   col1  col2  col3      col20
0     1   444   aaa  44.400000
1     2   555    bb  27.442930
2     3   666     c  28.234742
3     4   444    dd  44.400000
4     5   333  eeee  33.300000
5     6   222   fff  22.200000
6     7   666    gg  28.234742
7     8   777     h  28.904210
8     9   666     i  28.234742
9    10   555     j  27.442930

In [373]:
rf['Func_Applied']=rf['col2'].apply(lambda x:np.log(x))
rf

   col1  col2  col3      col20  Func_Applied
0     1   444   aaa  44.400000      6.095825
1     2   555    bb  27.442930      6.318968
2     3   666     c  28.234742      6.501290
3     4   444    dd  44.400000      6.095825
4     5   333  eeee  33.300000      5.808142
5     6   222   fff  22.200000      5.402677
6     7   666    gg  28.234742      6.501290
7     8   777     h  28.904210      6.655440
8     9   666     i  28.234742      6.501290
9    10   555     j  27.442930      6.318968

In [374]:
rf['col3length']=rf['col3'].apply(len)
print(rf)

   col1  col2  col3      col20  Func_Applied  col3length
0     1   444   aaa  44.400000      6.095825           3
1     2   555    bb  27.442930      6.318968           2
2     3   666     c  28.234742      6.501290           1
3     4   444    dd  44.400000      6.095825           2
4     5   333  eeee  33.300000      5.808142           4
5     6   222   fff  22.200000      5.402677           3
6     7   666    gg  28.234742      6.501290           2
7     8   777     h  28.904210      6.655440           1
8     9   666     i  28.234742      6.501290           1
9    10   555     j  27.442930      6.318968           1

In [376]:
rf['test']=rf['col2'].apply(lambda x:np.sqrt(x))
rf

   col1  col2  col3      col20  Func_Applied  col3length       test
0     1   444   aaa  44.400000      6.095825           3  21.071308
1     2   555    bb  27.442930      6.318968           2  23.558438
2     3   666     c  28.234742      6.501290           1  25.806976
3     4   444    dd  44.400000      6.095825           2  21.071308
4     5   333  eeee  33.300000      5.808142           4  18.248288
5     6   222   fff  22.200000      5.402677           3  14.899664
6     7   666    gg  28.234742      6.501290           2  25.806976
7     8   777     h  28.904210      6.655440           1  27.874720
8     9   666     i  28.234742      6.501290           1  25.806976
9    10   555     j  27.442930      6.318968           1  23.558438

In [377]:
print("\n sum of the column 'func applied is:",rf['Func_Applied'].sum())

 sum of the column 'func applied is: 62.19971458619886

In [381]:
print("\n Mean of the column 'func applied is:",rf['Func_Applied'].mean())

 Mean of the column 'func applied is: 6.219971458619886

In [382]:
print("\n std of the column'Func_Applied is",rf['Func_Applied'].std())

 std of the column'Func_Applied is 0.3822522801574853

In [384]:
print("\n MIN and MAX of the Column 'Func_Applied'are:",rf['Func_Applied'].min(),"and",rf['Func_Applied'].max())

 MIN and MAX of the Column 'Func_Applied'are: 5.402677381872279 and 6.655440350367647

In [386]:
### Deletion, sorting, list of column and row names
print("\n Name of columns \n",'-'*20,sep='')
print(rf.columns)

 Name of columns
--------------------
Index(['col1', 'col2', 'col3', 'col20', 'Func_Applied', 'col3length', 'test'], dtype='object')

In [389]:
l=list(rf.columns)
print("\n Columns names in alist of strings for manipualtion:",l)

 Columns names in alist of strings for manipualtion: ['col1', 'col2', 'col3', 'col20', 'Func_Applied', 'col3length', 'test']

In [390]:
#inplace false by default
rf.sort_values(by='col2')

   col1  col2  col3      col20  Func_Applied  col3length       test
5     6   222   fff  22.200000      5.402677           3  14.899664
4     5   333  eeee  33.300000      5.808142           4  18.248288
0     1   444   aaa  44.400000      6.095825           3  21.071308
3     4   444    dd  44.400000      6.095825           2  21.071308
1     2   555    bb  27.442930      6.318968           2  23.558438
9    10   555     j  27.442930      6.318968           1  23.558438
2     3   666     c  28.234742      6.501290           1  25.806976
6     7   666    gg  28.234742      6.501290           2  25.806976
8     9   666     i  28.234742      6.501290           1  25.806976
7     8   777     h  28.904210      6.655440           1  27.874720

In [393]:
del rf['test']
rf

   col1  col2  col3      col20  Func_Applied
0     1   444   aaa  44.400000      6.095825
1     2   555    bb  27.442930      6.318968
2     3   666     c  28.234742      6.501290
3     4   444    dd  44.400000      6.095825
4     5   333  eeee  33.300000      5.808142
5     6   222   fff  22.200000      5.402677
6     7   666    gg  28.234742      6.501290
7     8   777     h  28.904210      6.655440
8     9   666     i  28.234742      6.501290
9    10   555     j  27.442930      6.318968

In [396]:
rf.sort_values(by='Func_Applied',ascending=False)

   col1  col2  col3      col20  Func_Applied
7     8   777     h  28.904210      6.655440
2     3   666     c  28.234742      6.501290
6     7   666    gg  28.234742      6.501290
8     9   666     i  28.234742      6.501290
1     2   555    bb  27.442930      6.318968
9    10   555     j  27.442930      6.318968
0     1   444   aaa  44.400000      6.095825
3     4   444    dd  44.400000      6.095825
4     5   333  eeee  33.300000      5.808142
5     6   222   fff  22.200000      5.402677

In [1]:
import pandas as pd 
url='https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'
fr1=pd.read_csv(url,sep='\t')
fr1

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [2]:
fr1.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [4]:
fr1.tail(5)

,order_id,quantity,item_name,choice_description,item_price
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [7]:
fr1.shape[0]

4622

In [8]:
fr1.index

RangeIndex(start=0, stop=4622, step=1)